app/controllers/profiles_controller.rb

  def show
  	@user = User.find_by_profile_name(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."profile_name" = 'users' LIMIT 1