app/controllers/statuses_controller.rb

  def index
    @statuses = Status.all
---
SELECT "statuses".* FROM "statuses"

  def show
    @status = Status.find(params[:id])
---
SELECT "statuses".* FROM "statuses" WHERE "statuses"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @status = current_user.statuses.find(params[:id])
---
SELECT "statuses".* FROM "statuses" WHERE "statuses"."id" = ? LIMIT 1  [["id", "2"]]

  def create
    @status = current_user.statuses.new(params[:status])

    respond_to do |format|
      if @status.save
---
INSERT INTO "statuses" ("content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["content", "Hello World"], ["created_at", Wed, 11 Sep 2013 22:07:06 UTC +00:00], ["updated_at", Wed, 11 Sep 2013 22:07:06 UTC +00:00], ["user_id", 1]]

  def update
    @status = current_user.statuses.find(params[:id])
    if params[:status] && params[:status].has_key?(:user_id)
      params[:status].delete(:user_id)
    end

    respond_to do |format|
      if @status.update_attributes(params[:status])
---
SELECT "statuses".* FROM "statuses" WHERE "statuses"."user_id" = 1 AND "statuses"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "statuses" SET "content" = 'Today, I caught a shark, wow!', "updated_at" = '2013-09-16 18:04:48.147957' WHERE "statuses"."id" = 1

  def destroy
      @status = Status.find(params[:id])
      @status.destroy
---
SELECT "statuses".* FROM "statuses" WHERE "statuses"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "statuses" WHERE "statuses"."id" = ?  [["id", 1]]